ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Catalogs/УТЗ_ПЛ_Водители/УТЗ_ПЛ_Водители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УТЗ_ПЛ_Водители</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеПредставления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассВодителя</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_КлассыВодителей</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/InformationRegisters/УТЗ_ПЛ_ДокументыВодителей/УТЗ_ПЛ_ДокументыВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УТЗ_ПЛ_ДокументыВодителей</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Категории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Водители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_ВидыДокументовВодителя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Catalogs/УТЗ_ПЛ_Водители/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	СформироватьНаименование();
	Объект.ФамилияИО = ФамилияИнициалыФизическогоЛица(Объект.ФизическоеЛицо);
КонецПроцедуры

&НаКлиенте
Процедура ТабельныйНомерПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеПредставленияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьСписокДокументовВодителя(Команда)
	
	Отбор = Новый Структура("Водитель", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.УТЗ_ПЛ_ДокументыВодителей.Форма.ФормаСпискаСрезПоследних"
	, ПараметрыФормы
	, ЭтотОбъект
	, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	Объект.Наименование = "";
	
	Если ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
		Объект.Наименование = Объект.ФизическоеЛицо;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТабельныйНомер) Тогда 
		Объект.Наименование = Объект.Наименование + " " + Объект.ТабельныйНомер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДополнениеПредставления) Тогда 
		Объект.Наименование = Объект.Наименование + " [" + Объект.ДополнениеПредставления + "]";
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ФамилияИнициалыФизическогоЛица(ФизическоеЛицо)
	ФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "ФИО");	
	Возврат ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИО);
КонецФункции

#КонецОбласти
